// public static class Exersise501
//      public static void Task 34()
//     {
        // заполнение массива случайными положительными 
// трехзначными числами
//    int [] CreateArrayThreeDigitNumber (int count)
//    {
//     return new int[count];
//    }
//    void FillArrayThreeDigitNumber (int [] array, int min, int max)
//     {
//         int size = array.Length;
//         for (int i = 0; i < size; i++)
//         {
//             array[i] = new Random().Next(min, max);
//         }
//     }
//     Console.ReadLine();
    


// Задача 34: Задайте массив заполненный случайными положительными 
// трёхзначными числами. Напишите программу, 
// которая покажет количество чётных чисел в массиве.

// [345, 897, 568, 234] -> 2

// Задача 36: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.

// [3, 7, 23, 12] -> 19

// [-4, -6, 89, 6] -> 0

// Задача 38: Задайте массив вещественных чисел. Найдите разницу между максимальным и минимальным элементов массива.

// [3 7 22 2 78] -> 76


// "cSpell.language": "en,ru"
