//  Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16
Console.WriteLine("Start");
Console.WriteLine("Введите первое целое число A: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите второе целое число A: ");
int b = Convert.ToInt32(Console.ReadLine());
